package human;

/*
 * 생성자
 * 생성자란 클래스가 객체화 되어질 때 실제 객체를 생성해주는 코디이다.
 * 
 * 생성자는 그 외에도 아래와 같은 일을 한다.
 * 1. 클래스의 객체 생성
 * 2. 멤버필드 초기화
 * 3. 필요에 따라서 초기화 메소드 실행
 * 
 * 위 내용을 다시 정의하면 생성자가 없다면 인스턴스가 발생할 수 없다.
 * 
 * 생성자의 형식
 * 생성자는 메소드와 유사한 형식을 가진다.
 * 하지만 메소드와 기능적인 부분에서 차이가 있다.
 * 1. 생성자의 이름은 반드시 클래스명과 같아야 한다.
 * 		만약 다르다면 메소드로 인식한다.
 * 
 * 2. 메소드가 아니기 때문에 리턴타입이 없다.
 * -------------------------------------------------------------------
 * 기본 생성자(Default Constructor)
 * 자바에서는 모든 클래스마다 컴파일할 때 기본 생성자를 넣어준다.
 * 단, 클래스에 생성자가 하나라도 있다면 제공하지 않는다.
 * 즉, 프로그래머가 생성자를 만들지 않았다면 자바가 제공해주는 생성자.
 * 
 * 기본 생성자란
 * 파라미터(매개 변수)가 없는 생성자이고 이를 이용해서 생성된 인스턴스를 기본 객체라고 한다.
 * 또한 모든 필드의 값은 기본값으로 초기화된다.
 */
public class Constructor {

}
